rchristopher/Hexapod-UCT-Masters/HexapodControl/include/stm32f4xx_hal_conf.h
/**
  ******************************************************************************
  * @file    stm32f4xx_hal_conf.h
  * @author  MCD Application Team
  * @version V1.5.0
  * @date    06-May-2016
  * @brief   HAL configuration template file. 
  *          This file should be copied to the application folder and renamed
  *          to stm32f4xx_hal_conf.h.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

// [ILG]
#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpadded"
#endif

#ifdef __cplusplus
 extern "C" {
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/* ########################## Module Selection ############################## */
 /** @brief HAL Module Enabled **/
#define HAL_MODULE_ENABLED  
 /** @brief HAL ADC Module Enabled **/
#define HAL_ADC_MODULE_ENABLED
 /** @brief HAL CAN Module Enabled **/
#define HAL_CAN_MODULE_ENABLED
 /** @brief HAL CRC Module Enabled **/
#define HAL_CRC_MODULE_ENABLED
 /** @brief HAL CEC Module Enabled **/
#define HAL_CEC_MODULE_ENABLED
 /** @brief HAL CRYP Module Enabled **/
#define HAL_CRYP_MODULE_ENABLED
 /** @brief HAL DAC Module Enabled **/
#define HAL_DAC_MODULE_ENABLED
 /** @brief HAL DCMI Module Enabled  **/
#define HAL_DCMI_MODULE_ENABLED
 /** @brief HAL DMA Module Enabled **/
#define HAL_DMA_MODULE_ENABLED
 /** @brief HAL DMA2dModule Enabled **/
#define HAL_DMA2D_MODULE_ENABLED
 /** @brief HAL ETH Module Enabled **/
#define HAL_ETH_MODULE_ENABLED
 /** @brief HAL FLASH Module Enabled **/
#define HAL_FLASH_MODULE_ENABLED
 /** @brief HAL NAND Module Enabled **/
#define HAL_NAND_MODULE_ENABLED
 /** @brief HAL NOR Module Enabled **/
#define HAL_NOR_MODULE_ENABLED
 /** @brief HAL PCCARD Module Enabled **/
#define HAL_PCCARD_MODULE_ENABLED
 /** @brief HAL SRAM Module Enabled **/
#define HAL_SRAM_MODULE_ENABLED
 /** @brief HAL SDRAM Module Enabled **/
#define HAL_SDRAM_MODULE_ENABLED
 /** @brief HAL HASH Module Enabled **/
#define HAL_HASH_MODULE_ENABLED
 /** @brief HAL GPIO Module Enabled **/
#define HAL_GPIO_MODULE_ENABLED
 /** @brief HAL I2C Module Enabled **/
#define HAL_I2C_MODULE_ENABLED
 /** @brief HAL I2S Module Enabled **/
#define HAL_I2S_MODULE_ENABLED
 /** @brief HAL IWDG Module Enabled **/
#define HAL_IWDG_MODULE_ENABLED
 /** @brief HAL LTDC Module Enabled **/
#define HAL_LTDC_MODULE_ENABLED
 /** @brief HAL DSI Module Enabled **/
#define HAL_DSI_MODULE_ENABLED
 /** @brief HAL PWR Module Enabled **/
#define HAL_PWR_MODULE_ENABLED
 /** @brief HAL QSPI Module Enabled **/
#define HAL_QSPI_MODULE_ENABLED
 /** @brief HAL RCC Module Enabled **/
#define HAL_RCC_MODULE_ENABLED
 /** @brief HAL RNG Module Enabled **/
#define HAL_RNG_MODULE_ENABLED
 /** @brief HAL RTC Module Enabled **/
#define HAL_RTC_MODULE_ENABLED
 /** @brief HAL SAI Module Enabled **/
#define HAL_SAI_MODULE_ENABLED
 /** @brief HAL SD Module Enabled **/
#define HAL_SD_MODULE_ENABLED
 /** @brief HAL SPI Module Enabled  **/
#define HAL_SPI_MODULE_ENABLED
 /** @brief HAL TIM Module Enabled  **/
#define HAL_TIM_MODULE_ENABLED
 /** @brief HAL UART Module Enabled  **/
#define HAL_UART_MODULE_ENABLED
 /** @brief HAL USART Module Enabled  **/
#define HAL_USART_MODULE_ENABLED
 /** @brief HAL IRDA Module Enabled  **/
#define HAL_IRDA_MODULE_ENABLED
 /** @brief HAL SMARTCAR Module Enabled  **/
#define HAL_SMARTCARD_MODULE_ENABLED
 /** @brief HAL WWDG Module Enabled  **/
#define HAL_WWDG_MODULE_ENABLED
 /** @brief HAL CORTEX Module Enabled  **/
#define HAL_CORTEX_MODULE_ENABLED
 /** @brief HAL PCD Module Enabled  **/
#define HAL_PCD_MODULE_ENABLED
 /** @brief HAL HCD Module Enabled  **/
#define HAL_HCD_MODULE_ENABLED
 /** @brief HAL FMPI2C Module Enabled  **/
#define HAL_FMPI2C_MODULE_ENABLED
 /** @brief HAL SPDIFRX Module Enabled  **/
#define HAL_SPDIFRX_MODULE_ENABLED
 /** @brief HAL DFSDM Module Enabled  **/
#define HAL_DFSDM_MODULE_ENABLED
 /** @brief HAL LPTIM Module Enabled  **/
#define HAL_LPTIM_MODULE_ENABLED

/* ########################## HSE/HSI Values adaptation ##################### */
/**
  * @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSE is used as system clock source, directly or through the PLL).  
  */
#if !defined  (HSE_VALUE) 
  #define HSE_VALUE    ((uint32_t)25000000U) /*!< Value of the External oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined  (HSE_STARTUP_TIMEOUT)
  #define HSE_STARTUP_TIMEOUT    ((uint32_t)100U)   /*!< Time out for HSE start up, in ms */
#endif /* HSE_STARTUP_TIMEOUT */

/**
  * @brief Internal High Speed oscillator (HSI) value.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSI is used as system clock source, directly or through the PLL). 
  */
#if !defined  (HSI_VALUE)
  #define HSI_VALUE    ((uint32_t)16000000U) /*!< Value of the Internal oscillator in Hz*/
#endif /* HSI_VALUE */

/**
  * @brief Internal Low Speed oscillator (LSI) value.
  */
#if !defined  (LSI_VALUE) 
 #define LSI_VALUE  ((uint32_t)32000U)       /*!< LSI Typical Value in Hz*/
#endif /* LSI_VALUE */                      /*!< Value of the Internal Low Speed oscillator in Hz
                                             The real value may vary depending on the variations
                                             in voltage and temperature.*/
/**
  * @brief External Low Speed oscillator (LSE) value.
  */
#if !defined  (LSE_VALUE)
 #define LSE_VALUE  ((uint32_t)32768U)    /*!< Value of the External Low Speed oscillator in Hz */
#endif /* LSE_VALUE */

#if !defined  (LSE_STARTUP_TIMEOUT)
  #define LSE_STARTUP_TIMEOUT    ((uint32_t)5000U)   /*!< Time out for LSE start up, in ms */
#endif /* LSE_STARTUP_TIMEOUT */

/**
  * @brief External clock source for I2S peripheral
  *        This value is used by the I2S HAL module to compute the I2S clock source 
  *        frequency, this source is inserted directly through I2S_CKIN pad. 
  */
#if !defined  (EXTERNAL_CLOCK_VALUE)
  #define EXTERNAL_CLOCK_VALUE    ((uint32_t)12288000U) /*!< Value of the Internal oscillator in Hz*/
#endif /* EXTERNAL_CLOCK_VALUE */

